export default {
  //Navigation options
  navWork: "作品",
  navPost: "記事",
  navSource: "ソース",
  navHome: "ホーム",
   
  //Index Page
  changeLocale: "JP",
  indexIntro: "こんにちは、私は日本を拠点とするデータアナリストです！",
  indexTitle: "Tech Enthusiast（デジタルコンサルタント/プログラマー）",
  indexHeading1: "紹介",
  indexWork1: "私の名前はクアンです。現在、東京国際大学でデジタルビジネスとイノベーションを専攻している3年生です。 データアナリストまたはデータサイエンティストのポジションになることを目指してスキルセットを構築しています。 Python、R、Tableauを2年近く学び、データの視覚化と統計の経験があります。 それとは別に、あなたが今チェックしているページの基礎であるReact.js、Next.jsに興味を持ち始めました :)",
  indexWork2: "一般的なIT分野や分析職に関連するインターンシップを増やしたいと思います。",
  indexWork3: "プロフィールを読んでくれてありがとう！",
  indexButton: "私のポートフォリオ",
  indexHeading2: "伝記",
  indexYear2001: "ベトナムのホーチミン市に生まれる。",
  indexYear2019: "埼玉県でビジネス経済学の学士号を取得することを目的に東京国際大学に入学。",
  indexYear2022: "他のビジネスの問題解決を支援するデジタルコンサルタント（DX）として働いているAdam Innovationsで4か月のインターンシップを終了しました。",
  indexHeading3: "趣味",
  indexHobbies: "マンガ、音楽、ライトノベル、アニメ、動画ゲーム、食べ物の写真を撮る",
  indexHeading4: "連絡先",

  //Works Page
  workHeading1: "作品",
  workWork1: "最初のウェブページ",
  workParagraph1: "HTML/CSSとJavascriptについて学び始めた2021年に私が作ったクリニックのウェブページ",
  workHeading2: "コラボレーション",
  workCollab1: "ロストアークイベントボット",
  collabParagraph1: "ロストアークのイベント用の自動通知ボットを作成する際に友人を支援しました",

  //Work - firstProject.js
  fpTitle: "最初のウェブページ",
  fpParagraph1: "これは、2021/6年に大学のコースでグループプロジェクトで再設計されたクリニックのオフィスのWebページです。 このページの機能は次のとおりは：",
  fpList1: "クリニックの場所を示すインタラクティブなページ内マップ",
  fpList2: "クリニックのサービスを説明する複数のリダイレクトされたページ",
  fpList3: "言語交換用のドロップダウンメニューから英語と日本語の2つの言語で利用可能（残念ながらウェブサイト全体ではありません",
  fpList4: "デスクトップデバイスとモバイルデバイスの両方の表示エクスペリエンスに最適化",
  fpParagraph2: "このページは、Web開発を扱う最初のプロジェクトであるため特別です。",

  //Work - eventBot.js
  ebTitle: "ロストアークイベントボット",
  ebParagraph1: "ロストアークで発生するゲーム内イベントに関するDiscordアナウンス用に設計されたイベントボットを作成する際に友人@soulden1202を支援しました。ロストアークは、面倒な特定のゲーム内時間中に発生する多くの「ワールドアクティビティ」を含むMMORPGオンラインゲームです。 追跡します。 それを解決するために、彼はサーバー内の全員に自動的に通知するボットを作成することにしました。",
  ebParagraph2: "その機能は次のとおりは：",
  ebList1: "お知らせ",
  ebList2: "商人の場所と時間",
  ebList3: "フィールドボスイベント",
  ebList4: "カオスゲート",
  ebList5: "特別なゲーム内イベント",
  ebList6: "イベントタグの自動タグ付けを可能にして、X期間前にユーザーに通知します",
  ebParagraph3: "展開には専用サーバーホスティングが必要です",

  //Posts Page
  postHeading1: "タイムライン",
  postPost1: "このウェブサイトとReact.js",
  postParagraph1: "どうしてこのウェブサイトを作られるとフルスタック開発に関して僕の想い",

  //Post - thisWebsite.js
  twTitle: "私のポートフォリオ",
  twParagraph1: "状況は：大学3年生の終わりに、学校のキャリアセンターが主催する日本での就職活動セミナーを見て、将来のキャリアにも真剣に取り組む必要があることに気づきました。 その後、@Craftzdogが作成したYouTube動画を偶然見つけて独自のポートフォリオウェブサイトを作成しました。",
  twParagraph2: "例の動画です： ",
  twParagraph3: "簡単に言えば、私は夢中になりました。 彼が自分の作品を紹介するためにこのような素晴らしいウェブサイトをどのように作成したかに驚いています。 私は、ウェブサイトの開発に関する知識がほとんどまたはまったくないという背景から来ました。 確かに、私は2021年に1つのクラスに参加しました。その結果、私の仕事のページで見たかもしれない、つやのないクリニックオフィスのウェブサイトになりました。 クラスの外では、JavaScriptのコーディング能力を向上させたり、ウェブ開発に再び触れたりすることはできませんでした。 その後、タクヤと一緒に動画を見ながらコーディングを続け、JSの素晴らしさを実感しました。 ウェブサイトがいかにクリーンでミニマルであるかに魅了されたので、私にできることは、最初から始めて、彼とリズムを合わせてコードをよりよく理解することです。",
  twParagraph4: "つまり、これはフルスタック開発者が行うこと、または少なくとも部分的には彼または彼女が通常仕事で行うことです。 インターネット上のすべての素晴らしいウェブサイトの背後にある仕事は控えめに言っても巨大です。 このポートフォリオウェブサイトは、非常にミニマルですが、かなりのコーディングが必要です。 @Chakra-UIのような外部モジュラーデザインライブラリを使用しても、洗練された外観のユーザーインターフェイスの最適化ジョブの半分をすでに実行しています。",
  twParagraph5: "ウェブサイトのコード構造のほとんどはタクヤによって書かれていますが、私はウェブサイトの一般的な見た目と感じである最低のみを使用するようにしました。 特別な変更や機能は、ローカルサーバーで何時間もデバッグした後に実験したものです。 英語と日本語の間の言語交換機能、複数のデバイスでのさまざまな表示体験のためのサイズ変更可能なレイアウト、およびページの内容。",
  twParagraph6: "私はいつも自分自身についてパーソナライズされたウェブサイトを持つというアイデアが好きでした。 他の人があなたが誰で、何をしているかを知るためのマーケティングツールになる可能性があります。 自己学習の経験であり、過去の取り組みを振り返る道具だと思います。",
  twParagraph7: "私は、JavaScriptでのコーディングをそのバリアントであるNext.js、より一般的にはReact.jsで経験した後、開発者をより尊敬しています。 フルスタックの開発者であることは、私の意見では常に困難でしたが、特に今、彼らの仕事の責任の表面にほとんど触れずに、それを直接体験しました。 通過するのは難しいハードルであり、この時点で、私は作成者よりもユーザーであるという側面で技術を愛する何もないコーディング初心者です。",
};
