export default {
  //Index Page
  changeLocale: "JP",
  indexIntro: "こんにちは、私は日本を拠点とするデータアナリストです！",
  indexTitle: "Tech Enthusiast（デジタルコンサルタント/プログラマー）",
  indexHeading1: "紹介",
  indexWork1: "私の名前はクアンです。現在、東京国際大学でデジタルビジネスとイノベーションを専攻している3年生です。 データアナリストまたはデータサイエンティストのポジションになることを目指してスキルセットを構築しています。 Python、R、Tableauを2年近く学び、データの視覚化と統計の経験があります。 それとは別に、あなたが今チェックしているページの基礎であるReact.js、Next.jsに興味を持ち始めました :)",
  indexWork2: "一般的なIT分野や分析職に関連するインターンシップを増やしたいと思います。",
  indexWork3: "プロフィールを読んでくれてありがとう！",
  indexButton: "私のポートフォリオ",
  indexHeading2: "伝記",
  indexYear2001: "ベトナムのホーチミン市に生まれる。",
  indexYear2019: "埼玉県でビジネス経済学の学士号を取得することを目的に東京国際大学に入学。",
  indexYear2022: "他のビジネスの問題解決を支援するデジタルコンサルタント（DX）として働いているAdam Innovationsで4か月のインターンシップを終了しました。",
  indexHeading3: "趣味",
  indexHobbies: "マンガ、音楽、ライトノベル、アニメ、ビデオゲーム、食べ物の写真を撮る",
  indexHeading4: "連絡先",

  //Works Page
  workHeading1: "作品",
  workWork1: "最初のウェブページ",
  workParagraph1: "HTML/CSSとJavascriptについて学び始めた2021年に私が作ったクリニックのウェブページ",
  workHeading2: "コラボレーション",
  workCollab1: "ロストアークイベントボット",
  collabParagraph1: "ロストアークのイベント用の自動通知ボットを作成する際に友人を支援しました",

  //firstProject.js
  fpTitle: "最初のウェブページ",
  fpParagraph1: "これは、2021/6年に大学のコースでグループプロジェクトで再設計されたクリニックのオフィスのWebページです。 このページの機能は次のとおりは：",
  fpList1: "クリニックの場所を示すインタラクティブなページ内マップ",
  fpList2: "クリニックのサービスを説明する複数のリダイレクトされたページ",
  fpList3: "言語交換用のドロップダウンメニューから英語と日本語の2つの言語で利用可能（残念ながらウェブサイト全体ではありません",
  fpList4: "デスクトップデバイスとモバイルデバイスの両方の表示エクスペリエンスに最適化",
  fpParagraph2: "このページは、Web開発を扱う最初のプロジェクトであるため特別です。",

  //eventBot.js
  ebTitle: "ロストアークイベントボット",
  ebParagraph1: "ロストアークで発生するゲーム内イベントに関するDiscordアナウンス用に設計されたイベントボットを作成する際に友人@soulden1202を支援しました。ロストアークは、面倒な特定のゲーム内時間中に発生する多くの「ワールドアクティビティ」を含むMMORPGオンラインゲームです。 追跡します。 それを解決するために、彼はサーバー内の全員に自動的に通知するボットを作成することにしました。",
  ebParagraph2: "その機能は次のとおりは：",
  ebList1: "お知らせ",
  ebList2: "商人の場所と時間",
  ebList3: "フィールドボスイベント",
  ebList4: "カオスゲート",
  ebList5: "特別なゲーム内イベント",
  ebList6: "イベントタグの自動タグ付けを可能にして、X期間前にユーザーに通知します",
  ebParagraph3: "展開には専用サーバーホスティングが必要です",
};
